#Какие типы данные есть.
"""
int - Целые числа
float - Дробные числа
bool - Логический тип данных.(True/False)
str - Строка
"""
#язык python это язык динамичеких типов данных.
#Объявляем переменную int.
n = 5
print(n)
#Теперь объявим float.
n = 5.68
print(n)
#python сам определит какая она.
#Чтоб присвоить пустое значение.
n = None
print(n)
# Создаём строку.
n = "Привет"
print(n)
"""
Много зачений указали всего одной переменной n, и чтоб просто каждое значение вывелось на экран
под каждым прописываем print. Если сравнить с C++ такая тема не прокатит, так как если переменная
объявлена, то поторно нельзя уже. 
"""