'''
Задача 0.
Дан список чисел. Определите, сколько в нем
встречается различных чисел.
'''
list = [1, 1, 2, 0, -1, 3, 4, 4]
unique_numbers = set(list)
print("Количество различных чисел в списке:", len(unique_numbers))
